app/controllers/items_controller.rb

  def index
    @items = Item.all
---
SELECT `items`.* FROM `items`

  def show
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 0 LIMIT 1

  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save
---
INSERT INTO `items` (`created_at`, `item`, `quantidade_item`, `updated_at`) VALUES ('2013-04-15 14:04:51', 'Sabao', 1, '2013-04-15 14:04:51')

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 3 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 3